Ran Plan for dir: `GCP_Bucket_Creation` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_storage_bucket.bucket1 will be created
+ resource "google_storage_bucket" "bucket1" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "bucket1"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "REGIONAL"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 15
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = "ANY"
            }
        }

      + retention_policy {
          + is_locked        = true
          + retention_period = 432000
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # google_storage_bucket_object.object1 will be created
+ resource "google_storage_bucket_object" "object1" {
      + bucket         = "bucket1"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "sample_image"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "image1.png"
      + storage_class  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d GCP_Bucket_Creation`
* :put_litter_in_its_place: To **delete** this plan click [here](http://d03477dc3ffd:4141/lock?id=yashwanthm998%252Fatlantis%252FGCP_Bucket_Creation%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d GCP_Bucket_Creation`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
